MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM3HPFYAFG/mcu.h
#define TSB_UART5_SWRST_SWRSTF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->SWRST,7)))
#define TSB_UART5_CR0_PE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,2)))
#define TSB_UART5_CR0_EVEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,3)))
#define TSB_UART5_CR0_SBLEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,4)))
#define TSB_UART5_CR0_DIR                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,5)))
#define TSB_UART5_CR0_IV                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,6)))
#define TSB_UART5_CR0_WU                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,8)))
#define TSB_UART5_CR0_RTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,9)))
#define TSB_UART5_CR0_CTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,10)))
#define TSB_UART5_CR0_LPB                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,15)))
#define TSB_UART5_CR0_HBSEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,16)))
#define TSB_UART5_CR0_HBSMD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,17)))
#define TSB_UART5_CR0_HBSST                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR0,18)))
#define TSB_UART5_CR1_DMARE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,0)))
#define TSB_UART5_CR1_DMATE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,1)))
#define TSB_UART5_CR1_INTERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,2)))
#define TSB_UART5_CR1_INTRXWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,4)))
#define TSB_UART5_CR1_INTRXFE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,5)))
#define TSB_UART5_CR1_INTTXWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,6)))
#define TSB_UART5_CR1_INTTXFE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->CR1,7)))
#define TSB_UART5_BRD_KEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->BRD,23)))
#define TSB_UART5_TRANS_RXE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->TRANS,0)))
#define TSB_UART5_TRANS_TXE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->TRANS,1)))
#define TSB_UART5_TRANS_TXTRG                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->TRANS,2)))
#define TSB_UART5_TRANS_BK                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->TRANS,3)))
#define TSB_UART5_DR_BERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->DR,16)))
#define TSB_UART5_DR_FERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->DR,17)))
#define TSB_UART5_DR_PERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->DR,18)))
#define TSB_UART5_SR_RXFF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->SR,5)))
#define TSB_UART5_SR_RXEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->SR,6)))
#define TSB_UART5_SR_RXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->SR,7)))
#define TSB_UART5_SR_TXFF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->SR,13)))
#define TSB_UART5_SR_TXEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->SR,14)))
#define TSB_UART5_SR_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->SR,15)))
#define TSB_UART5_SR_SUE                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART5->SR,31)))
#define TSB_UART5_FIFOCLR_RFCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART5->FIFOCLR,0)))
#define TSB_UART5_FIFOCLR_TFCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART5->FIFOCLR,1)))
#define TSB_UART5_ERR_BERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->ERR,0)))
#define TSB_UART5_ERR_FERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->ERR,1)))
#define TSB_UART5_ERR_PERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->ERR,2)))
#define TSB_UART5_ERR_OVRERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->ERR,3)))
#define TSB_UART5_ERR_TRGERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART5->ERR,4)))

#define TSB_UART6_SWRST_SWRSTF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART6->SWRST,7)))
#define TSB_UART6_CR0_PE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,2)))
#define TSB_UART6_CR0_EVEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,3)))
#define TSB_UART6_CR0_SBLEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,4)))
#define TSB_UART6_CR0_DIR                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,5)))
#define TSB_UART6_CR0_IV                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,6)))
#define TSB_UART6_CR0_WU                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,8)))
#define TSB_UART6_CR0_RTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,9)))
#define TSB_UART6_CR0_CTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,10)))
#define TSB_UART6_CR0_LPB                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,15)))
#define TSB_UART6_CR0_HBSEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,16)))
#define TSB_UART6_CR0_HBSMD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,17)))
#define TSB_UART6_CR0_HBSST                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR0,18)))
#define TSB_UART6_CR1_DMARE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR1,0)))
#define TSB_UART6_CR1_DMATE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR1,1)))
#define TSB_UART6_CR1_INTERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR1,2)))
#define TSB_UART6_CR1_INTRXWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR1,4)))
#define TSB_UART6_CR1_INTRXFE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR1,5)))
#define TSB_UART6_CR1_INTTXWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR1,6)))
#define TSB_UART6_CR1_INTTXFE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->CR1,7)))
#define TSB_UART6_BRD_KEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->BRD,23)))
#define TSB_UART6_TRANS_RXE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->TRANS,0)))
#define TSB_UART6_TRANS_TXE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->TRANS,1)))
#define TSB_UART6_TRANS_TXTRG                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->TRANS,2)))
#define TSB_UART6_TRANS_BK                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->TRANS,3)))
#define TSB_UART6_DR_BERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART6->DR,16)))
#define TSB_UART6_DR_FERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART6->DR,17)))
#define TSB_UART6_DR_PERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART6->DR,18)))
#define TSB_UART6_SR_RXFF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->SR,5)))
#define TSB_UART6_SR_RXEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->SR,6)))
#define TSB_UART6_SR_RXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART6->SR,7)))
#define TSB_UART6_SR_TXFF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->SR,13)))
#define TSB_UART6_SR_TXEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->SR,14)))
#define TSB_UART6_SR_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART6->SR,15)))
#define TSB_UART6_SR_SUE                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART6->SR,31)))
#define TSB_UART6_FIFOCLR_RFCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART6->FIFOCLR,0)))
#define TSB_UART6_FIFOCLR_TFCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART6->FIFOCLR,1)))
#define TSB_UART6_ERR_BERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->ERR,0)))
#define TSB_UART6_ERR_FERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->ERR,1)))
#define TSB_UART6_ERR_PERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->ERR,2)))
#define TSB_UART6_ERR_OVRERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->ERR,3)))
#define TSB_UART6_ERR_TRGERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART6->ERR,4)))

#define TSB_UART7_SWRST_SWRSTF                    (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART7->SWRST,7)))
#define TSB_UART7_CR0_PE                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,2)))
#define TSB_UART7_CR0_EVEN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,3)))
#define TSB_UART7_CR0_SBLEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,4)))
#define TSB_UART7_CR0_DIR                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,5)))
#define TSB_UART7_CR0_IV                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,6)))
#define TSB_UART7_CR0_WU                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,8)))
#define TSB_UART7_CR0_RTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,9)))
#define TSB_UART7_CR0_CTSE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,10)))
#define TSB_UART7_CR0_LPB                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,15)))
#define TSB_UART7_CR0_HBSEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,16)))
#define TSB_UART7_CR0_HBSMD                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,17)))
#define TSB_UART7_CR0_HBSST                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR0,18)))
#define TSB_UART7_CR1_DMARE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR1,0)))
#define TSB_UART7_CR1_DMATE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR1,1)))
#define TSB_UART7_CR1_INTERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR1,2)))
#define TSB_UART7_CR1_INTRXWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR1,4)))
#define TSB_UART7_CR1_INTRXFE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR1,5)))
#define TSB_UART7_CR1_INTTXWE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR1,6)))
#define TSB_UART7_CR1_INTTXFE                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->CR1,7)))
#define TSB_UART7_BRD_KEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->BRD,23)))
#define TSB_UART7_TRANS_RXE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->TRANS,0)))
#define TSB_UART7_TRANS_TXE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->TRANS,1)))
#define TSB_UART7_TRANS_TXTRG                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->TRANS,2)))
#define TSB_UART7_TRANS_BK                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->TRANS,3)))
#define TSB_UART7_DR_BERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART7->DR,16)))
#define TSB_UART7_DR_FERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART7->DR,17)))
#define TSB_UART7_DR_PERR                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART7->DR,18)))
#define TSB_UART7_SR_RXFF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->SR,5)))
#define TSB_UART7_SR_RXEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->SR,6)))
#define TSB_UART7_SR_RXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART7->SR,7)))
#define TSB_UART7_SR_TXFF                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->SR,13)))
#define TSB_UART7_SR_TXEND                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->SR,14)))
#define TSB_UART7_SR_TXRUN                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART7->SR,15)))
#define TSB_UART7_SR_SUE                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_UART7->SR,31)))
#define TSB_UART7_FIFOCLR_RFCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART7->FIFOCLR,0)))
#define TSB_UART7_FIFOCLR_TFCLR                   (*((__O  uint32_t *)BITBAND_PERI(&TSB_UART7->FIFOCLR,1)))
#define TSB_UART7_ERR_BERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->ERR,0)))
#define TSB_UART7_ERR_FERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->ERR,1)))
#define TSB_UART7_ERR_PERR                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->ERR,2)))
#define TSB_UART7_ERR_OVRERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->ERR,3)))
#define TSB_UART7_ERR_TRGERR                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_UART7->ERR,4)))


/* SIWD */
#define TSB_SIWD0_EN_WDTE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_SIWD0->EN,0)))
#define TSB_SIWD0_EN_WDTF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_SIWD0->EN,1)))
#define TSB_SIWD0_MOD_RESCR                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_SIWD0->MOD,0)))
#define TSB_SIWD0_MOD_INTF                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_SIWD0->MOD,1)))
#define TSB_SIWD0_OSCCR_OSCPRO                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_SIWD0->OSCCR,0)))


